Repository: mamirjamali/wp-clickup-status-plugin
Catalog: languages/clickup-status-plugin-*.po
Languages: ar, fa_ir

source: Click Up Status Settings
ar: إعدادات حالة Click Up
fa_ir: تنظیمات وضعیت Click UP

source: GF Settings
ar: إعدادات GF
fa_ir: تنظیمات GF

source: Add New Form
ar: إضافة نموذج جديد
fa_ir: افزودن فرم جدید

source: Form ID
ar: معرف النموذج
fa_ir: شناسه فرم

source: Add Gravity Form ID
ar: إضافة معرف نموذج Gravity
fa_ir: شناسه فرم Gravity Form را اضافه کنید

source: Add Your ClickUP Personal API Key
ar: أضف مفتاح API الشخصي لـ ClickUP الخاص بك
fa_ir: کلید API شخصی ClickUP خود را اضافه کنید

source: List ID
ar: معرف القائمة
fa_ir: شناسه لیست

source: Add ClickUP List ID to send the form data to
ar: أضف معرف ClickUP List لإرسال بيانات النموذج إليه
fa_ir: افزودن ClickUP List ID برای ارسال اطلاعات فرم

source: Custom fields
ar: الحقول المخصصة
fa_ir: فیلدهای سفارشی

source: If your ClickUP account supports custom fields, you can enable this feature. Ensure that your field names match the custom fields, or they will be added to the description section.
ar: إذا كان حساب ClickUP الخاص بك يدعم الحقول المخصصة ، يمكنك تمكين هذه الميزة. تأكد من أن أسماء الحقول الخاصة بك تتطابق مع الحقول المخصصة ، وإلا سيتم إضافتها إلى قسم الوصف.
fa_ir: اگر حساب ClickUP شما از فیلدهای سفارشی پشتیبانی می کند، می توانید این ویژگی را فعال کنید. مطمئن شوید که نام فیلدهای شما با فیلدهای سفارشی مطابقت داشته باشد، در غیر این صورت به بخش توضیحات اضافه خواهند شد.

source: Send tracking code
ar: إرسال رمز التتبع
fa_ir: ارسال کد رهگیری

source: Enable sending email to the user to track the status of their request for this form
ar: تمكين إرسال بريد إلكتروني إلى المستخدم لتتبع حالة طلبهم لهذا النموذج
fa_ir: ارسال ایمیل به کاربر برای پیگیری وضعیت درخواست او برای این فرم را فعال کنید

source: Email Field ID
ar: معرف حقل البريد الإلكتروني
fa_ir: شناسه فیلد ایمیل

source: GF Tracking Code Field (optional)
ar: GF رمز تتبع النموذج (اختياري)
fa_ir: فیلد کد رهگیری GF (اختیاری)

source: To include the tracking code with form entries for display in the form entries settings, consider adding a hidden field to your form and placing the ID there.
ar: لتضمين رمز التتبع مع إدخالات النموذج لعرضها في إعدادات إدخال النموذج ، يرجى إضافة حقلًا مخفيًا إلى نموذجك ووضع الهوية هناك.
fa_ir: برای گنجاندن کد رهگیری با ورودی‌های فرم برای نمایش در تنظیمات ورودی‌های فرم، یک فیلد مخفی به فرم خود اضافه کنید و شناسه را در آنجا قرار خواهد گرفت.

source: Add Form
ar: إضافة نموذج
fa_ir: افزودن فرم

source: If the form already exists, adding it again will update the settings in case any changes have been made.
ar: إذا كان النموذج موجودًا بالفعل ، فإن إضافته مرة أخرى ستقوم بتحديث الإعدادات في حال أي تغييرات تمت.
fa_ir: اگر فرم از قبل وجود داشته باشد، در صورت ایجاد هرگونه تغییر، با افزودن مجدد آن، تنظیمات به‌روزرسانی می‌شود.

source: Fields to send to ClickUP for the added forms
ar: الحقول لإرسالها إلى ClickUP للنماذج المضافة
fa_ir: فیلدهایی که برای ارسال به ClickUP برای فرم های اضافه شده

source: Note: Please be aware that Attachment fields and Custom fields must be sent individually, necessitating one request for each file and each field. This is due to ClickUP not supporting arrays for these types.
ar: ملاحظة: يرجى أن تكون على علم بأن حقول المرفقات والحقول المخصصة يجب أن ترسل على حدة ، مما يستلزم طلبًا لكل ملف وكل حقل. يرجى العلم أن ClickUP لا يدعم المصفوفات لهذه الأنواع.
fa_ir: توجه: لطفاً توجه داشته باشید که فیلدهای پیوست و فیلدهای سفارشی باید به صورت جداگانه ارسال شوند که نیاز به یک درخواست برای هر فایل و هر فیلد دارد. دلیل این امر این است که ClickUP از آرایه‌های این نوع پشتیبانی نمی‌کند.

source: Field Name
ar: اسم الحقل
fa_ir: نام فیلد

source: If you intend to save this field into Click UP custom fields, make sure to first enable the Custom Field option for the form, and second, enter the field name exactly matching the Custom Field name.
ar: إذا كنت تنوي حفظ هذا الحقل في حقول Click UP المخصصة ، تأكد من تمكين خيار الحقل المخصص للنموذج أولاً ، وثانيًا ، أدخل اسم الحقل بالضبط متطابقًا مع اسم الحقل المخصص.
fa_ir: اگر می‌خواهید این فیلد را در قسمت‌های سفارشی Click UP ذخیره کنید، ابتدا گزینه Custom Field را برای فرم فعال کرده‌اید و دوم، نام فیلد را دقیقاً مطابق با نام فیلد سفارشی وارد کنید.

source: Field ID
ar: هوية الحقل
fa_ir: شناسه فیلد

source: Enter the Field ID for the form where you want to save its data into Click UP
ar: أدخل هوية الحقل للنموذج حيث تريد حفظ بياناته في Click UP
fa_ir: شناسه فیلد فرمی را که می‌خواهید داده‌های آن را در Click UP ذخیره کنید، وارد کنید

source: Form ID: %s
ar: هوية النموذج: %s
fa_ir: شناسه فرم: %s

source: Select the form from the ones you have added here.
ar: حدد النموذج من بين النماذج التي قد أضفتها هنا.
fa_ir: فرم را از بین فرم هایی که در اینجا اضافه کرده اید انتخاب کنید.

source: Task Name
ar: اسم المهمة
fa_ir: نام تسک

source: Selecting this checkbox designates the field to be used as the Task Name in ClickUP. By default, the first field added to the form will be chosen as the Task Name. However, you can change it by selecting a different field when adding a new field. Ensure at least one field is designated as the Task Name.
ar: بتحديد هذا الخانة يتم استخدام الحقل كاسم المهمة في ClickUP. بشكل افتراضي ، سيتم اختيار أول حقل يتم إضافته إلى النموذج كاسم مهمة. ومع ذلك ، يمكنك تغييره عند اختيار حقل مختلف عند إضافة حقل جديد. تأكد من تحديد حقل واحد على الأقل كاسم مهمة.
fa_ir: انتخاب این کادر انتخاب، فیلدی را که به عنوان نام تسک در ClickUP استفاده می شود، مشخص می کند. به طور پیش فرض، اولین فیلد اضافه شده به فرم به عنوان نام تسک انتخاب می شود. با این حال، می‌توانید با انتخاب یک فیلد دیگر هنگام افزودن یک فیلد جدید، آن را تغییر دهید. مطمئن شوید که حداقل یک فیلد به عنوان نام تسک تعیین شده است.

source: Attachment
ar: المرفق
fa_ir: پیوست

source: Mark the field as an attachment field
ar: قم بوضع علامة على الحقل كحقل مرفق
fa_ir: فیلد را به عنوان فیلد پیوست علامت بزنید

source: Add Field
ar: إضافة حقل
fa_ir: اضافه کردن فیلد

source: If the field already exists (add existing Field Name), adding it again will update the fields' data in case any changes have been made.
ar: إذا كان الحقل موجودًا بالفعل (أضف اسم الحقل الحالي) ، فإن إضافته مرة أخرى ستقوم بتحديث بيانات الحقول في حال أي تغييرات تمت.
fa_ir: اگر فیلد از قبل وجود داشته باشد (نام فیلد موجود را اضافه کنید)، با افزودن مجدد آن، در صورت ایجاد هرگونه تغییر، اطلاعات فیلدها به روز می شود.

source: Forms configuration overview and associated fields:
ar: نظرة عامة على تكوين النماذج والحقول المرتبطة:
fa_ir: نمای کلی پیکربندی فرم ها و فیلدهای مرتبط:

source: Form Configurations =>
ar: تكوين النماذج =>
fa_ir: تنظیمات فرم =>

source: Form ID:
ar: معرف النموذج:
fa_ir: شناسه فرم:

source: List ID:
ar: معرف القائمة:
fa_ir: شناسه لیست:

source: Task Name Field:
ar: حقل اسم المهمة:
fa_ir: فیلد نام تسک:

source: Email Field:
ar: حقل البريد الإلكتروني:
fa_ir: فیلد ایمیل:

source: Field Type
ar: نوع الحقل
fa_ir: نوع فیلد

source: Files type are either Attachment or Regular
ar: يمكن أن يكون نوع الملفات إما ملحق أو عادي
fa_ir: نوع فیلدها پیوست یا معمولی هستند

source: Action
ar: عمل
fa_ir: عملیات

source: Delete Field
ar: حذف الحقل
fa_ir: حذف فیلد

source: %s <i class="fas fa-question-circle" data-toggle="tooltip" title="This field name is present in your ClickUP custom fields list with the defined Name."></i>
ar: %s <i class="fas fa-question-circle" data-toggle="tooltip" title="هذا الاسم الحقل موجود في قائمة حقولك المخصصة في ClickUP بالاسم المحدد."></i>
fa_ir: %s <i class="fas fa-question-circle" data-toggle="tooltip" title="این نام فیلد در لیست فیلدهای سفارشی ClickUP شما با نام تعریف شده وجود دارد."></i>

source: ClickUp Configuration
ar: تكوين ClickUp
fa_ir: پیکربندی کلیک آپ

source: Configure your ClickUp settings below.
ar: قم بتكوين إعدادات ClickUp أدناه
fa_ir: تنظیمات ClickUp خود را در زیر پیکربندی کنید.

source: Tracking Form
ar: نموذج التتبع
fa_ir: فرم پیگیری

source: Status
ar: الحالة
fa_ir: وضعیت

source: Description
ar: الوصف
fa_ir: توضیحات

source: Description to show in the frontend
ar: الوصف الذي يظهر في الواجهة الأمامية
fa_ir: توضیحاتی که در صفحه جلویی در فرم پیگیری نمایش داده خواهد شد.

source: Update Description
ar: تحديث الوصف
fa_ir: بروز رسانی توضیحات

source: Configure your Tracking Form settings below.
ar: قم بتكوين إعدادات نموذج التتبع أدناه.
fa_ir: تنظیمات فرم پگیری را در زیر پیکربندی کنید.

source: To edit the Tracking Form you should first add a form.
ar: لتحرير نموذج التتبع، يجب عليك أولاً إضافة نموذج.
fa_ir: برای ویرایش فرم پیگیری ابتدا یک فرم اضافه کنید

source: You can define the description to display for each status in the tracking form.
ar: يمكنك تحديد الوصف الذي سيظهر لكل حالة في نموذج التتبع.
fa_ir: می‌توانید توضیحاتی که برای هر وضعیت در فرم پیگیری نمایش داده می‌شود، تعریف کنید.

source: To make the description dynamic, use the following variables: {{status}} and {{assignee}}. For instance, you can create a dynamic description like this: "Your status is {{status}} and is being investigated by {{assignee}}". These variables will be replaced with actual values when displayed.
ar: لجعل الوصف ديناميكيًا ، استخدم المتغيرات التالية: {{status}} و {{assignee}}. على سبيل المثال ، يمكنك إنشاء وصف ديناميكي مثل هذا: "حالتك هي {{status}} وتمت المعاينة بواسطة {{assignee}}". سيتم استبدال هذه المتغيرات بالقيم الفعلية عند العرض.
fa_ir: برای ساخت توضیحات پویا، از متغیرهای زیر استفاده کنید: {{status}} و {{assignee}}. به عنوان مثال، می‌توانید یک توضیح پویا مانند "وضعیت شما {{status}} است و توسط {{assignee}} در حال پیگیری می باشد". این متغیرها با مقادیر واقعی جایگزین می‌شوند هنگام نمایش.

source: #In order to use this form add <b style="color: #8481f5;">[clickup_status_form]</b> shortcode to your desired page.
fa_ir: برای استفاده از این فرم، شورتکد <b style="color: #8481f5;">[clickup_status_form]</b> را به صفحه دلخواه خود اضافه کنید.

source: Tracking Form Settings
ar: إعدادات نموذج التتبع
fa_ir: تنظیمات فرم پیگیری

source: The entered values do not match
ar: القيم المدخلة لا تتطابق
fa_ir: اطلاعات وارد شده مطابقت ندارد

source: Submit
ar: إرسال
fa_ir: ارسال

source: ClickUp Status Plugin
fa_ir: پلاگین ClickUp Status

source: This plugin enable the admin to connect Gravity Forms to Click UP and let the users to track the status of the form they have submitted
ar: يمكن لهذا المكون الإضافي تمكين المسؤول من ربط Gravity Forms بـ Click UP والسماح للمستخدمين بتتبع حالة النموذج الذي قدموه
fa_ir: این افزونه ادمین را قادر می‌سازد تا Gravity Forms را به کلیک UP متصل کند و به کاربران اجازه دهد وضعیت فرم ارسالی خود را پیگیری کنند.

source: Amir Jamali
ar: أمير جمالي
fa_ir: امیر جمالی

source: API Key
ar: مفتاح API
